# -*- coding: utf8 -*-
#!/usr/bin/env python

import subprocess
import shlex
import os


def gather(ip, oid):
    cmd = 'snmpwalk -c public -v 2c ' + ip + ' ' + oid
    p = subprocess.Popen(shlex.split(cmd), stdin=subprocess.PIPE, stdout=subprocess.PIPE, stderr=subprocess.PIPE)
    out, err = p.communicate()
    #out = out.strip()
    #print(len(out.split('\n')))
    #index = 0
    #print repr(out)
    #for i in out.split('\n'):
    #    print('%d : %s' % (index + 1, i))
    #    index += 1
    #print('out : %s' % (out))
    #print('err : %s' % (err))
    #print err.strip() == ''
    #return (out.strip(), err.strip())    
    return out.strip()


namelist = ['设备名', '端口名称', '端口状态', '端口速率', 'arp信息', '设备运行时间',
            '设备routeid', '端口描述', '端口进流量', '端口出流量', '端口进error包',
            '端口出error包', '端口ip', '端口掩码', '端口所在ospf的域', '端口cost',
            'dev_areaid', 'dev_version', '端口ID', 'BGP标识', 'BGP对端状态',
            'bgp设备所在AS', 'BGP连接的本地IP', 'CPU', '温度', 'dev_mac', 'dev_vlan',
            '端口收光功率', '端口发光功率']

oidlist = [
'1.3.6.1.2.1.1.1',
'1.3.6.1.2.1.2.2.1.2',
'1.3.6.1.2.1.31.1.1.1.18',
'1.3.6.1.2.1.2.2.1.8',
'1.3.6.1.2.1.4.22.1.2',
'1.3.6.1.2.1.1.3',
'1.3.6.1.2.1.14.1.1',
'1.3.6.1.2.1.2.2.1.2',
'1.3.6.1.2.1.31.1.1.1.6',
'1.3.6.1.2.1.31.1.1.1.10',
'1.3.6.1.2.1.2.2.1.14',
'1.3.6.1.2.1.2.2.1.20',
'1.3.6.1.2.1.4.20.1.2',
'1.3.6.1.2.1.4.20.1.3',
'1.3.6.1.2.1.14.7.1.3',
'1.3.6.1.2.1.14.8.1.4',
'1.3.6.1.2.1.14.2.1.1',
'1.3.6.1.2.1.1.1',
'1.3.6.1.2.1.2.2.1.2',
'1.3.6.1.2.1.15.4',
'1.3.6.1.2.1.15.3.1.2',
'1.3.6.1.2.1.15.2',
'1.3.6.1.2.1.15.3.1.5'
]


f = open('output.txt', 'w')
for i in range(23):
    f.write(namelist[i] + os.linesep)
    f.write(gather('192.168.30.40', oidlist[i]).strip() + os.linesep)
#(out, err) = gather('192.168.30.40', '1.3.6.1.2.1.31.1.1.1.18')
#print('out : %s' % (out))
#print('err : %s' % (err))
#print out == ''
#print err == ''
#out.split(':')[-1] == ''
#设备名
#gather('192.168.30.23', '1.3.6.1.2.1.1.1')
#端口描述
#gather('192.168.30.23', '1.3.6.1.2.1.2.2.1.2')
#端口名
#gather('192.168.30.23', '1.3.6.1.2.1.31.1.1.1.18')
#端口状态
#print gather('192.168.30.23', '1.3.6.1.2.1.2.2.1.8')
#ARP信息
#gather('192.168.30.23', '1.3.6.1.2.1.4.22.1.2')
#设备运行时间
#gather('192.168.30.23', '1.3.6.1.2.1.1.3')
#设备routeid
#gather('192.168.30.23', '1.3.6.1.2.1.14.1.1')
#端口描述
#gather('192.168.30.23', '1.3.6.1.2.1.2.2.1.2')
#端口进流量
#gather('192.168.30.23', '1.3.6.1.2.1.31.1.1.1.6')
#端口出流量
#gather('192.168.30.23', '1.3.6.1.2.1.31.1.1.1.10')
#端口进error包
#gather('192.168.30.23', '1.3.6.1.2.1.2.2.1.14')
#端口出error包
#gather('192.168.30.23', '1.3.6.1.2.1.2.2.1.20')
#端口ip
#gather('192.168.30.23', '1.3.6.1.2.1.4.20.1.2')
#端口掩码
#gather('192.168.30.23', '1.3.6.1.2.1.4.20.1.3')
#端口所在ospf的域
#gather('192.168.30.23', '1.3.6.1.2.1.14.7.1.3')
#端口cost
#gather('192.168.30.23', '1.3.6.1.2.1.14.8.1.4')
#dev_areaid
#gather('192.168.30.23', '1.3.6.1.2.1.14.2.1.1')
#dev_version
#gather('192.168.30.23', '1.3.6.1.2.1.1.1')
#端口ID
#gather('192.168.30.23', '1.3.6.1.2.1.2.2.1.2')
#BGP标识
#gather('192.168.30.23', '1.3.6.1.2.1.15.4')
#BGP对端状态
#gather('192.168.30.23', '1.3.6.1.2.1.15.3.1.2')
#bgp设备所在AS
#gather('192.168.30.23', '1.3.6.1.2.1.15.2')
#BGP连接的本地IP
#gather('192.168.30.23', '1.3.6.1.2.1.15.3.1.5')
#
#gather('192.168.30.23', '')
#
#gather('192.168.30.23', '')
#
#gather('192.168.30.23', '')
#
#gather('192.168.30.23', '')
#
#gather('192.168.30.23', '')
#
#gather('192.168.30.23', '')
#
#gather('192.168.30.23', '')

